## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloud9_environment_ec2.minha-instancia-ec2 will be created
  + resource "aws_cloud9_environment_ec2" "minha-instancia-ec2" {
      + arn             = (known after apply)
      + connection_type = "CONNECT_SSH"
      + id              = (known after apply)
      + image_id        = "amazonlinux-1-x86_64"
      + instance_type   = "t2.micro"
      + name            = "minha-maquina"
      + owner_arn       = (known after apply)
      + tags_all        = (known after apply)
      + type            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>